# Chinook Analysis

![png](Data/ERD.png)

In [1]:
import pandas as pd
from sqlalchemy import create_engine
import pymysql
pymysql.install_as_MySQLdb()

## Change username and password to match your personal MySQL Server settings
username = 'root' # default username for MySQL db is root
password = 'l3gg0mysql!' # whatever password you chose during MySQL installation.

connection = f'mysql+pymysql://{username}:{password}@localhost/Chinook'
engine = create_engine(connection)

In [2]:
q = """SHOW TABLES;"""
pd.read_sql(q, engine)

   Tables_in_chinook
0              Album
1             Artist
2           Customer
3           Employee
4              Genre
5            Invoice
6        InvoiceLine
7          MediaType
8           Playlist
9      PlaylistTrack
10             Track

## Queries

1. What is the most a customer has spent on a single purchase and what is their customerId?
2. What country is the customer with the largest total bill from (from question 2)?
3. Which customerID made the fewest purchases (invoices)?
4. Retrieve the id, name, and # of playlists for tracks that appear on playlists more than 4 times?

### 1. What is the most a customer has spent on a single purchase and what is their customerId?

In [5]:
q = """SELECT 
    customerId, Total
FROM
    Invoice
ORDER BY Total DESC
LIMIT 1"""
pd.read_sql(q, engine)

   customerId  Total
0           6  25.86